#include <stdio.h>

int task1() {
    printf("123\n");
    printf("1\n2\n3\n");
    printf("1\n\t2\n\t\t3\n");
    printf("параметры:\n %2d\n %4d\n %6d\n %8d\n", 1, 2, 3, 4);
    printf("%10.3f\n ", 12.234657);
    printf("%10.5f\n ", 12.234657);
    printf("Остаток от деления %d на %d равен %d\n ", 5, 2, 5 % 2);
    printf("Деление %d на %d равно %d\n ", 7, 5, 7 / 5);
    printf("Если умножить %d на %d получится %d\n ", 2000, 4, 2000 * 4);

    printf("%g разделить %e равно %f\n", 5., 2000000., 5. / 2000000);
    printf("%d разделить %d равно %d\n", 5., 2000000., 5. / 2000000);
    printf("%f разделить %f равно %f\n", 5., 2000000., 5. / 2000000);
    printf("%g разделить %g равно %g\n", 5., 2000000., 5. / 2000000);
    printf("%e разделить %e равно %e\n", 5., 2000000., 5. / 2000000);

    return 0;
}

int task2() {
    int N = 23, K = 20;

    printf("«Сейчас %d часов %d минут 00 секунд»\n", N, K);
    printf("«Идет %d минута суток»\n", N * 60 + K);

    printf("«До полуночи осталось %d часов и %d минут»\n",
           (24 * 60 - (N * 60 + K)) / 60,
           (24 * 60 - (N * 60 + K)) % 60);

    printf("«С 8.00 прошло %d секунд»\n",
           (N * 3600 + K * 60) - (8 * 3600));

    printf("«Текущий час = %.2f суток и текущая минута = %.2f часа»\n",
           N / 24.0, K / 60.0);

    return 0;
}

int task3() {
    int n = 4, L = 323, k = 5, m = 1;

    printf("Дано:\n%5d\n%5d\n\n\t________\nОтвет:\n%-+8.1f\n",
           n, L, (n * 1.0) / L);

    return 0;
}

int main() {
    task1();
    printf("\n");

    task2();
    printf("\n");

    task3();

    return 0;
}